<a href="https://colab.research.google.com/github/JeromeCheon/gcs_AIproject/blob/master/assignments/hw2_pandas_numpy.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 1.

#In the cell below, create a DataFrame `fruits` that looks like this:

![](https://i.imgur.com/Ax3pp2A.png)

In [3]:
import pandas as pd

fruits = pd.DataFrame({'Apple': {0:30},'Bananas':{0:21}})
# fruits = pd.Series({'Apple':30, 'Bananas':30})
fruits

   Apple  Bananas
0     30       21

## 2.

Create a dataframe `fruit_sales` that matches the diagram below:

![](https://i.imgur.com/CHPn7ZF.png)

In [4]:
# Ans2
fruit_sales = pd.DataFrame({'Apple': {'2017 Sales':35, '2018 Sales':41},'Bananas':{'2017 Sales':21, '2018 Sales':34}})
fruit_sales

            Apple  Bananas
2017 Sales     35       21
2018 Sales     41       34

## 3.
## Question : Create a 1D array of numbers from 0 to 9
## Output :  array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [7]:
import numpy as np
# Ans3
# np.arange(10) # this is also the answer
test = np.array(range(10))
test

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

## 4.
## Question: Convert a 1D array to a 2D array with 2 rows
## input: np.arange(10)
## output array([[0, 1, 2, 3, 4],
##               [5, 6, 7, 8, 9]])

In [8]:
# Ans4
np.arange(10).reshape(2,-1)

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

## 5.
## Question: From the array a, replace all values greater than 30 to 30 and less than 10 to 10.

In [9]:
np.set_printoptions(precision=2)
np.random.seed(100)
a = np.random.uniform(1,50,20) # uniform 한 random 숫자 생성 
# Ans5
a[a>30] = 30
a[a<10] = 10
a

array([27.63, 14.64, 21.8 , 30.  , 10.  , 10.  , 30.  , 30.  , 10.  ,
       29.18, 30.  , 11.25, 10.08, 10.  , 11.77, 30.  , 30.  , 10.  ,
       30.  , 14.43])

In [10]:
company = "케이존"
name = "천재홍"
print(f'{company}의 {name} 개발자 과제 2 제출합니다.  감사합니다.')

케이존의 천재홍 개발자 과제 2 제출합니다.  감사합니다.